<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<head>
	<meta http-equiv="content-type" content="text/html; charset=windows-1252">
	<title></title>
	<meta name="generator" content="LibreOffice 4.2.5.2 (Windows)">
	<meta name="created" content="20141031;163254028000000">
	<meta name="changed" content="20141031;171734563000000">
	<style type="text/css">
	<!--
		@page { margin: 2cm }
		p { margin-bottom: 0.25cm; line-height: 120% }
	-->
	</style>
</head>
<body lang="sv-SE" dir="ltr">
<p style="margin-bottom: 0cm; line-height: 100%">Hej.</p>
<p style="margin-bottom: 0cm; line-height: 100%">H&auml;r &auml;r
jag. En fd IT-arbetare med bakgrund som systemansvarig f&ouml;r
administrativa system i Novell, Linux och i viss m&aring;n MS
Servermilj&ouml;. Konsult och utvecklingschef p&aring; ett mindre
IT-f&ouml;retag med inriktning p&aring; transportadministration.</p>
<p style="margin-bottom: 0cm; line-height: 100%">Den delen av livet
tog slut straxt efter 2000, f&ouml;retaget jag arbetade p&aring; och
jag gick in i v&auml;ggen.</p>
<p style="margin-bottom: 0cm; line-height: 100%">Min erfarenhet d&aring;
var programmering i fr&auml;mst VB och Magic.</p>
<p style="margin-bottom: 0cm; line-height: 100%">Under min bortvaro
fr&aring;n IT-sektorn, n&auml;r jag testat att vara shiatsu-terapeut,
driva kaf&eacute; och k&ouml;ra taxi, har jag lekt en hel del med
Wordpress, anpassat, tweakat och skrivit plugins f&ouml;r mina egna
behov.</p>
<p style="margin-bottom: 0cm; line-height: 100%">BTH och dessa kurser
har jag s&ouml;kt mig till f&ouml;r att f&ouml;rdjupa och bredda mina
kunskaper, och framf&ouml;r allt &auml;ntligen f&aring; koll p&aring;
CSS och Javascript, som jag fuskar i. PHP k&auml;nns tryggt, har en
bra baskunskap och har jobbat med objektorienterad PHP.</p>
<p style="margin-bottom: 0cm; line-height: 100%">Min utvecklingsmilj&ouml;
&auml;r i f&ouml;rsta hand Linux. FTP med FireFTP, utveckling sedan
n&aring;got &aring;r i Netbeans. Mot BTH laddar jag upp filerna med
Filezilla.</p>
<p style="margin-bottom: 0cm; line-height: 100%">Med hj&auml;lp av
snabb uppkoppling s&aring; anv&auml;nder jag mig av en av mina
dom&auml;ner p&aring; binero som testmilj&ouml;, jag litar p&aring;
att det &auml;r r&auml;tt konfigurerat, jag slipper det tidigare
pysslet med egen server. 
</p>
<p style="margin-bottom: 0cm; line-height: 100%">Information h&auml;mtar
jag nog i f&ouml;rsta hand fr&aring;n PHP-manualen p&aring; n&auml;tet
och <cite><b>w3schools</b></cite><cite>.com.</cite></p>
<p style="margin-bottom: 0cm; line-height: 100%"><br>
</p>
<p style="margin-bottom: 0cm; line-height: 100%"><cite>Som framg&aring;r
av ovanst&aring;ende gick guiden ganska snabbt att g&aring; igenom.
N&aring;gra guldklimpar hittade jag. &lt;? ?&gt;, &lt;?= ?&gt; &auml;r
underbara, heredoc har jag heller aldrig testat tidigare.</cite></p>
<p style="margin-bottom: 0cm; line-height: 100%"><br>
</p>
<p style="margin-bottom: 0cm; line-height: 100%"><cite>Min webmall
heter tango. Namnvalet var f&ouml;r mig sj&auml;lvklart. Argentinsk
tango &auml;r en improviserad pardans utan begr&auml;nsningar, bara
m&ouml;jligheter, d&auml;r man st&auml;ndigt str&auml;var efter
f&ouml;rfining och perfektion, utveckling av det som finns och jakt
efter nya m&ouml;jligheter. </cite>
</p>
<p style="margin-bottom: 0cm; line-height: 100%"><cite>En dans d&auml;r
man st&auml;ndigt dansar med nya partners och d&auml;rigenom m&aring;ste
vara flexibel f&ouml;r att kunna ge tillfredst&auml;llelse.</cite></p>
<p style="margin-bottom: 0cm; line-height: 100%"><br>
</p>
<p style="margin-bottom: 0cm; line-height: 100%"><cite>Strukturen i
Anax ... beh&ouml;ll jag med n&aring;gra f&aring; avsteg. Min f&ouml;rsta
tanke var: Array? Varf&ouml;r inte en klass. Det ger mig st&ouml;rre
m&ouml;jligheter. </cite>
</p>
<p style="margin-bottom: 0cm; line-height: 100%"><br>
</p>
<p style="margin-bottom: 0cm; line-height: 100%"><cite>S&aring; i
tango styrs det mesta fr&aring;n klassen Ctango, som vill bli matat
med info. Dock finns redan defaultv&auml;rden p&aring; m&aring;nga
f&ouml;r att minska arbetet.  Alla variabler &auml;r interna, man f&aring;r
g&aring; via metoder f&ouml;r att komma &aring;t dem. Jag vill ha
kommandot. Kontrollfreak? Javisst.</cite></p>
<p style="margin-bottom: 0cm; line-height: 100%"><br>
</p>
<p style="margin-bottom: 0cm; line-height: 100%"><cite>I
index.tpl.php finns ingen kod, bara anrop till de funktioner som ger
utskriften. Som default skapas &lt;head&gt; av klassen, men m&ouml;jlighet
finns givetvis att skapa en egen i sidmallen och skicka in i klassen
f&ouml;r utskrift. </cite>
</p>
<p style="margin-bottom: 0cm; line-height: 100%"><br>
</p>
<p style="margin-bottom: 0cm; line-height: 100%"><cite>Det som inte
fungerar &auml;r att koppla flera stylesheets till klassen f&ouml;r
l&auml;nkning, det kommer, m&aring;ste dock s&auml;tta ig&aring;ng
med n&auml;sta kurs medan tid &auml;r. </cite>
</p>
<p style="margin-bottom: 0cm; line-height: 100%"><br>
</p>
<p style="margin-bottom: 0cm; line-height: 100%"><cite>Source.php
fungerade bra att inkludera, med lite fix i surce.css s&aring; det
gick ihop med min &ouml;vriga sida.</cite></p>
<p style="margin-bottom: 0cm; line-height: 100%"><br>
</p>
<p style="margin-bottom: 0cm; line-height: 100%"><cite>Koden finns p&aring;
github, l&auml;nk ner till h&ouml;ger p&aring; sidan.</cite></p>
<p style="margin-bottom: 0cm; line-height: 100%"><br>
</p>
<p style="margin-bottom: 0cm; line-height: 100%"><br>
</p>
<p style="margin-bottom: 0cm; line-height: 100%"><br>
</p>
<p style="margin-bottom: 0cm; line-height: 100%"><br>
</p>
</body>
</html>